package Dictionary;

//Словарь перевода слов:
//
//Создайте HashMap, где ключом является слово на английском языке,
// а значением - варианты его перевода на другой язык.
//Когда вы задаете английское слово, то вы можете добавить несколько вариантов перевода
// (постарайтесь процесс добавления перевода сделать отдельным методом,
//то есть ваш метод будет получать два параметра - английское слово и его перевод)
//Добавьте в словарь пять слов.
//Выведите перевод слова, введенного пользователем.

public class Vocabulary {
}
